In [12]:
import pandas as pd
import numpy as np
import sidetable

In [13]:
df=pd.read_csv('../EDA/datos/attack_limpieza3.csv', index_col=0)
df.sample(2)

,case_number,year,type,country,activity,age,time,species_,mes,fatal_,sex2,cleaned_species
5089,1934.10.02,1934,Unprovoked,australia,Freediving for trochus shell (submerged),27,NaN,NAN,Oct,y,M,Undefined
68,ND-0123,1976,Unprovoked,usa,Shark tagging,21,18h00,"Blacktip shark, 5'",NaN,n,F,Undefined

## Limpieza e Imputaci√≥n IV - Imputaci√≥n Valores Nulos

Es el momento de ponernos a trabajar con los valores nulos üí™üèΩ. A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. En la lecci√≥n hemos aprendido varios m√©todos, nosotras os planteamos los ejercicios pero sentiros libres de usar el m√©todo que m√°s se adapte a vuestras necesidades. Manos a la obra!

- EJERCICIO 1: Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¬øHay alguna columna con una gran cantidad de nulos? En caso de que sea as√≠ deberemos eliminarla.

In [14]:
df.stb.missing()

                 missing  total    percent
time                3363   6327  53.153153
fatal_               618   6327   9.767662
mes                  576   6327   9.103841
sex2                 569   6327   8.993204
activity             544   6327   8.598072
country               50   6327   0.790264
type                   4   6327   0.063221
case_number            1   6327   0.015805
year                   0   6327   0.000000
age                    0   6327   0.000000
species_               0   6327   0.000000
cleaned_species        0   6327   0.000000

Vamos a eliminar la columna "time" ya que tiene un porcentaje de nulos del 53%

In [15]:
df=df.drop(["time"], axis=1)

In [16]:
df.sample(2)

,case_number,year,type,country,activity,age,species_,mes,fatal_,sex2,cleaned_species
3200,1981.02.19,1981,Unprovoked,south africa,Swimming,30,Juvenile dusky or blacktip shark,Feb,n,M,Undefined
268,2017.08.26.b,2017,Invalid,spain,Swimming,27,Shark involvement questionable,Aug,NaN,F,Undefined

- EJERCICIO 2: Es el momento de eliminar los nulos:

> Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [17]:
media=round(df["age"].mean(),2)

In [18]:
df["age"]=df["age"].fillna(media)

> En relaci√≥n a la columna de country al tratarse de una columna de tipo categ√≥rica, reemplazad los valores nulos por una nueva categ√≥ria que se llame Unknown.

In [19]:
df["country"].replace(np.nan, "Unknown", inplace=True)

> Reemplazad los valores nulos de la columna fatal por Unknown.

In [20]:
df["fatal_"].replace(np.nan, "Unknown", inplace=True)

> Reemplazad los valores nulos de la columna type por el valor m√°s frecuente (la moda).

In [21]:
df["type"].replace(np.nan, "Unknown", inplace=True)

> Reemplazad los valores nulos de la columna fecha por Unknown.

In [22]:
df["mes"].replace(np.nan, "Unknown", inplace=True)

In [23]:
df.isnull().sum()

case_number          1
year                 0
type                 0
country              0
activity           544
age                  0
species_             0
mes                  0
fatal_               0
sex2               569
cleaned_species      0
dtype: int64

- EJERCICIO 3: Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair.

In [24]:
df.to_csv("../EDA/datos/attack_limpieza4.csv")